<a href="https://colab.research.google.com/github/Sarmingsteiner/ml_graz_final_project/blob/master/Final_1_nh_cleaning.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Load Libraries

In [0]:
import pandas as pd
import numpy as np
import plotly.express as px
import plotly.graph_objects as go

# Load Data

In [25]:
!wget https://www.attax.at/bank-additional-full.csv

--2020-05-31 23:45:14--  https://www.attax.at/bank-additional-full.csv
Resolving www.attax.at (www.attax.at)... 213.145.224.160
Connecting to www.attax.at (www.attax.at)|213.145.224.160|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 5834924 (5.6M) [text/csv]
Saving to: ‘bank-additional-full.csv.4’

bank-additional-ful 100%[===================>]   5.56M  4.21MB/s    in 1.3s

2020-05-31 23:45:16 (4.21 MB/s) - ‘bank-additional-full.csv.4’ saved [5834924/5834924]

In [0]:
df = pd.read_csv("bank-additional-full.csv.4", sep=";")

In [28]:
df.head()

   age        job  marital  ... euribor3m nr.employed   y
0   56  housemaid  married  ...     4.857      5191.0  no
1   57   services  married  ...     4.857      5191.0  no
2   37   services  married  ...     4.857      5191.0  no
3   40     admin.  married  ...     4.857      5191.0  no
4   56   services  married  ...     4.857      5191.0  no

[5 rows x 21 columns]

## Rename Columns for Convenience

In [0]:
df.columns = [x.replace('.', '_') for x in df.columns]

In [33]:
df.head()

   age        job  marital  ... euribor3m nr_employed   y
0   56  housemaid  married  ...     4.857      5191.0  no
1   57   services  married  ...     4.857      5191.0  no
2   37   services  married  ...     4.857      5191.0  no
3   40     admin.  married  ...     4.857      5191.0  no
4   56   services  married  ...     4.857      5191.0  no

[5 rows x 21 columns]

In [42]:
df.tail()

       age          job  marital  ... euribor3m nr_employed    y
41183   73      retired  married  ...     1.028      4963.6  yes
41184   46  blue-collar  married  ...     1.028      4963.6   no
41185   56      retired  married  ...     1.028      4963.6   no
41186   44   technician  married  ...     1.028      4963.6  yes
41187   74      retired  married  ...     1.028      4963.6   no

[5 rows x 21 columns]

In [40]:
df.columns.to_list()

['age',
 'job',
 'marital',
 'education',
 'default',
 'housing',
 'loan',
 'contact',
 'month',
 'day_of_week',
 'duration',
 'campaign',
 'pdays',
 'previous',
 'poutcome',
 'emp_var_rate',
 'cons_price_idx',
 'cons_conf_idx',
 'euribor3m',
 'nr_employed',
 'y']

In [41]:
df.describe()

               age      duration  ...     euribor3m   nr_employed
count  41188.00000  41188.000000  ...  41188.000000  41188.000000
mean      40.02406    258.285010  ...      3.621291   5167.035911
std       10.42125    259.279249  ...      1.734447     72.251528
min       17.00000      0.000000  ...      0.634000   4963.600000
25%       32.00000    102.000000  ...      1.344000   5099.100000
50%       38.00000    180.000000  ...      4.857000   5191.000000
75%       47.00000    319.000000  ...      4.961000   5228.100000
max       98.00000   4918.000000  ...      5.045000   5228.100000

[8 rows x 10 columns]

In [46]:
df.job.isunique

AttributeError: ignored

## Check Missing Values

In [34]:
df.isna().sum()

age               0
job               0
marital           0
education         0
default           0
housing           0
loan              0
contact           0
month             0
day_of_week       0
duration          0
campaign          0
pdays             0
previous          0
poutcome          0
emp_var_rate      0
cons_price_idx    0
cons_conf_idx     0
euribor3m         0
nr_employed       0
y                 0
dtype: int64

In [0]:
df.to_csv("cleantest.csv", index=False)

In [0]:
df = pd.read_csv("cleantest.csv", sep=";")